# REQUIREMENTS
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# DEVELOPMENT
tap "dart-lang/dart"
tap "sass/sass"
tap "shivammathur/php"

brew "bash"
brew "composer"
brew "openldap"
brew "dnsmasq", restart_service: true
brew "unixodbc"
brew "gh"
brew "gnu-sed"
brew "libevent"
brew "httpd", restart_service: true
brew "imagemagick"
brew "libiconv"
brew "libpq"
brew "n"
brew "nginx", restart_service: true
brew "nmap"
brew "nvm"
brew "php", restart_service: true
brew "php@7.4"
brew "pyenv"
brew "python@3.8"
brew "telnet"
brew "wget"
brew "wp-cli"
brew "sass/sass/migrator"
brew "sass/sass/sass"

cask "iterm2"

# FONTS
tap "homebrew/cask-fonts"

cask "font-fantasque-sans-mono"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"

# CREATURE COMFORTS
brew "neofetch"
brew "z"
brew "zsh-syntax-highlighting"

cask "background-music"
cask "betterzip"
cask "monitorcontrol"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "webpquicklook"
